cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'puma/puma'

# required by elasticsearch
cask 'homebrew/cask-versions/java8'

brew 'ack'
brew 'autoconf'
brew 'automake'
brew 'cmake'
brew 'coreutils'
brew 'curl'
brew 'elasticsearch'
brew 'ffmpeg'
brew 'git-standup'
brew 'gnupg'
brew 'go'
brew 'grc'
brew 'imagemagick'
brew 'jp2a'
brew 'jq'
brew 'libgit2'
brew 'mariadb'
brew 'mas'
brew 'nginx'
brew 'node'
brew 'openssl'
brew 'pinentry-mac'
brew 'postgis'
brew 'postgresql'
brew 'puma/puma/puma-dev'
brew 'rabbitmq'
brew 'rbenv'
brew 'readline'
brew 'redis'
brew 'roundup'
brew 'ruby-build'
brew 'spaceman-diff'
brew 'unrar'
brew 'wget'
brew 'xz'
brew 'yajl'
brew 'yarn'

cask 'android-file-transfer'
cask 'android-studio'
cask 'atom'
cask 'caffeine'
cask 'cleanmymac'
cask 'dropbox'
cask 'firefox'
cask 'flume'
cask 'google-chrome'
cask 'insomnia'
cask 'postbird'
cask 'sketch'
cask 'slack'
cask 'sequel-pro'
cask 'skim'
cask 'skype'
cask 'toggl'
cask 'transmission'
cask 'viber'
cask 'vlc'

mas 'XCode', id: 497799835
mas '250+ Solitaires', id: 680532369
mas 'The Unarchiver', id: 425424353
mas 'Keynote', id: 409183694
mas 'Evernote', id: 406056744
mas 'Skitch', id: 425955336
mas '3Hub', id: 427515976
mas 'RAR Extractor Lite', id: 646295438
mas 'Telegram', id: 747648890
mas 'Todoist', id: 585829637
mas 'Pages', id: 409201541
mas 'Numbers', id: 409203825
