cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'puma/puma'

# required by elasticsearch
cask 'homebrew/cask-versions/java8'

brew 'ack'
brew 'autoconf'
brew 'automake'
brew 'cmake'
brew 'coreutils'
brew 'curl'
brew 'elasticsearch'
brew 'ffmpeg'
brew 'flow'
brew 'git-standup'
brew 'gnupg'
brew 'go'
brew 'grc'
brew 'imagemagick'
brew 'jp2a'
brew 'jq'
brew 'libgit2'
brew 'mariadb'
brew 'mas'
brew 'nginx'
brew 'nvm'
brew 'node'
brew 'openssl'
brew 'pinentry-mac'
brew 'postgis'
brew 'postgresql'
brew 'puma/puma/puma-dev'
brew 'rabbitmq'
brew 'rbenv'
brew 'readline'
brew 'redis'
brew 'roundup'
brew 'ruby-build'
brew 'spaceman-diff'
brew 'unrar'
brew 'wget'
brew 'xz'
brew 'yajl'
brew 'yarn'
brew 'zeromq'
brew 'zsh-completions'

cask 'github'
cask 'google-chrome'
cask 'insomnia'
cask 'postbird'
cask 'slack'
cask 'visual-studio-code'

mas 'XCode', id: 497799835
mas 'The Unarchiver', id: 425424353
mas '3Hub', id: 427515976
mas 'RAR Extractor Lite', id: 646295438
